programming/java/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-10-05 Mon 00:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>java - labs127.io and me</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kholid Fuadi" />
<link rel="stylesheet" type="text/css" href="../../stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">java - labs127.io and me</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. PDF Link Stamper</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> PDF Link Stamper</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Snippet</i> ini berfungsi untuk menambahkan <i>stamp</i> berupa link yang
ditaruh di pojok-kiri-bawah setiap halaman pdf.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">Anchor</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">Chunk</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">DocumentException</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">Element</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">Font</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">FontFactory</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">Phrase</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #63b8ff;">Rectangle</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #8470ff; font-weight: bold;">pdf</span>.<span style="color: #63b8ff;">ColumnText</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #8470ff; font-weight: bold;">pdf</span>.<span style="color: #63b8ff;">PdfContentByte</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #8470ff; font-weight: bold;">pdf</span>.<span style="color: #63b8ff;">PdfReader</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">com</span>.<span style="color: #8470ff; font-weight: bold;">itextpdf</span>.<span style="color: #8470ff; font-weight: bold;">text</span>.<span style="color: #8470ff; font-weight: bold;">pdf</span>.<span style="color: #63b8ff;">PdfStamper</span>;

<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">java</span>.<span style="color: #8470ff; font-weight: bold;">io</span>.<span style="color: #63b8ff;">FileOutputStream</span>;
<span style="color: #00ffff;">import</span> <span style="color: #8470ff; font-weight: bold;">java</span>.<span style="color: #8470ff; font-weight: bold;">io</span>.<span style="color: #63b8ff;">IOException</span>;

<span style="color: #fa8072; font-style: italic;">/*</span>
<span style="color: #ff7f24; font-style: italic;"> * source of inspiration:</span>
<span style="color: #ff7f24; font-style: italic;"> * http://tutorials.jenkov.com/java-itext/modifying-pdf-documents.html</span>
<span style="color: #ff7f24; font-style: italic;"> * http://blindcoder.wordpress.com/2012/12/10/itext-adding-web-links-at-an-absolute-position-in-java/</span>
<span style="color: #ff7f24; font-style: italic;"> */</span>

<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">StampText</span> {

  <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #63b8ff;">void</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">main</span>(<span style="color: #63b8ff;">String</span>[] <span style="color: #7fffd4;">args</span>) <span style="color: #00ffff;">throws</span> <span style="color: #63b8ff;">InterruptedException</span> {
    <span style="color: #00ffff;">try</span> {

        <span style="color: #fa8072; font-style: italic;">// </span><span style="color: #ff7f24; font-style: italic;">processbuilder for qpdf</span>
        <span style="color: #63b8ff;">ProcessBuilder</span> <span style="color: #7fffd4;">pb</span> = <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">ProcessBuilder</span>(<span style="color: #ffc1c1;">"qpdf"</span>,
                                               <span style="color: #ffc1c1;">"--decrypt"</span>,
                                               <span style="color: #ffc1c1;">"/home/banteng/Desktop/test.pdf"</span>,
                                               <span style="color: #ffc1c1;">"/home/banteng/Desktop/test2.pdf"</span>);
        <span style="color: #63b8ff;">Process</span> <span style="color: #7fffd4;">p</span> = pb.start();
        p.waitFor();
        
        <span style="color: #63b8ff;">PdfReader</span> <span style="color: #7fffd4;">pdfReader</span> = <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">PdfReader</span>(<span style="color: #ffc1c1;">"/home/banteng/Desktop/test2.pdf"</span>);

        <span style="color: #63b8ff;">PdfStamper</span> <span style="color: #7fffd4;">pdfStamper</span> = <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">PdfStamper</span>(pdfReader,
        <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">FileOutputStream</span>(<span style="color: #ffc1c1;">"/home/banteng/Desktop/test3.pdf"</span>));

        <span style="color: #00ffff;">for</span>(<span style="color: #63b8ff;">int</span> <span style="color: #7fffd4;">i</span>=1; i&lt;= pdfReader.getNumberOfPages(); i++){

          <span style="color: #63b8ff;">PdfContentByte</span> <span style="color: #7fffd4;">content</span> = pdfStamper.getOverContent(i);

          <span style="color: #fa8072; font-style: italic;">// </span><span style="color: #ff7f24; font-style: italic;">get page size</span>
          <span style="color: #63b8ff;">Rectangle</span> <span style="color: #7fffd4;">crop</span> = pdfReader.getCropBox(i);
          
          <span style="color: #fa8072; font-style: italic;">// </span><span style="color: #ff7f24; font-style: italic;">font untuk anchor (default == 6)</span>
          <span style="color: #63b8ff;">Font</span> <span style="color: #7fffd4;">font</span> = FontFactory.getFont(<span style="color: #8470ff; font-weight: bold;">FontFactory</span>.COURIER, 6,
                                          <span style="color: #8470ff; font-weight: bold;">Font</span>.UNDERLINE);
          font.setColor(0, 0, 255);
          <span style="color: #fa8072; font-style: italic;">// </span><span style="color: #ff7f24; font-style: italic;">font untuk pre (default == 6)</span>
          <span style="color: #63b8ff;">Font</span> <span style="color: #7fffd4;">pre</span> = FontFactory.getFont(<span style="color: #8470ff; font-weight: bold;">FontFactory</span>.COURIER, 6);
          pre.setColor(0, 0, 0);
          <span style="color: #fa8072; font-style: italic;">// </span><span style="color: #ff7f24; font-style: italic;">adding phrase pre</span>
          <span style="color: #63b8ff;">Phrase</span> <span style="color: #7fffd4;">phrase0</span> = <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">Phrase</span>(<span style="color: #ffc1c1;">"Downloaded from"</span>, pre);
          <span style="color: #63b8ff;">Phrase</span> <span style="color: #7fffd4;">phrase1</span> = <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">Phrase</span>(<span style="color: #ffc1c1;">"awesome site"</span>, pre);
          <span style="color: #63b8ff;">Chunk</span> <span style="color: #7fffd4;">chunk</span> = <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">Chunk</span>(<span style="color: #ffc1c1;">"www.example.com"</span>, font);
          <span style="color: #63b8ff;">Anchor</span> <span style="color: #7fffd4;">anchor</span> = <span style="color: #00ffff;">new</span> <span style="color: #63b8ff;">Anchor</span>(chunk);
          anchor.setReference(<span style="color: #ffc1c1;">"http://www.example.com"</span>);
          
          <span style="color: #fa8072; font-style: italic;">// </span><span style="color: #ff7f24; font-style: italic;">setting default</span>
          
          ColumnText.showTextAligned(content,
                                     <span style="color: #8470ff; font-weight: bold;">Element</span>.ALIGN_LEFT,
                                     phrase0,
                                     crop.getLeft() + 15,
                                     crop.getBottom() + 10, 0);
          ColumnText.showTextAligned(content,
                                     <span style="color: #8470ff; font-weight: bold;">Element</span>.ALIGN_LEFT,
                                     anchor,
                                     crop.getLeft() + 74,
                                     crop.getBottom() + 10, 0);
          ColumnText.showTextAligned(content,
                                     <span style="color: #8470ff; font-weight: bold;">Element</span>.ALIGN_LEFT,
                                     phrase1,
                                     crop.getLeft() + 137,
                                     crop.getBottom() + 10, 0);
          
          <span style="color: #fa8072; font-style: italic;">/*</span>
<span style="color: #ff7f24; font-style: italic;">          ColumnText.showTextAligned(content,</span>
<span style="color: #ff7f24; font-style: italic;">                                     Element.ALIGN_LEFT,</span>
<span style="color: #ff7f24; font-style: italic;">                                     phrase0,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getLeft() + 22,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getBottom() + 1, 0);</span>
<span style="color: #ff7f24; font-style: italic;">          ColumnText.showTextAligned(content,</span>
<span style="color: #ff7f24; font-style: italic;">                                     Element.ALIGN_LEFT,</span>
<span style="color: #ff7f24; font-style: italic;">                                     anchor,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getLeft() + 83,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getBottom() + 1, 0);</span>
<span style="color: #ff7f24; font-style: italic;">          ColumnText.showTextAligned(content,</span>
<span style="color: #ff7f24; font-style: italic;">                                     Element.ALIGN_LEFT,</span>
<span style="color: #ff7f24; font-style: italic;">                                     phrase1,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getLeft() + 145,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getBottom() + 1, 0);</span>
<span style="color: #ff7f24; font-style: italic;">          */</span>
          
          <span style="color: #fa8072; font-style: italic;">// </span><span style="color: #ff7f24; font-style: italic;">setting untuk halaman kecil</span>
          <span style="color: #fa8072; font-style: italic;">/*</span>
<span style="color: #ff7f24; font-style: italic;">          ColumnText.showTextAligned(content,</span>
<span style="color: #ff7f24; font-style: italic;">                                     Element.ALIGN_LEFT,</span>
<span style="color: #ff7f24; font-style: italic;">                                     phrase0,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getLeft() + 45,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getBottom() + 1, 0);</span>
<span style="color: #ff7f24; font-style: italic;">          ColumnText.showTextAligned(content,</span>
<span style="color: #ff7f24; font-style: italic;">                                     Element.ALIGN_LEFT,</span>
<span style="color: #ff7f24; font-style: italic;">                                     anchor,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getLeft() + 93,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getBottom() + 1, 0);</span>
<span style="color: #ff7f24; font-style: italic;">          ColumnText.showTextAligned(content,</span>
<span style="color: #ff7f24; font-style: italic;">                                     Element.ALIGN_LEFT,</span>
<span style="color: #ff7f24; font-style: italic;">                                     phrase1,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getLeft() + 144,</span>
<span style="color: #ff7f24; font-style: italic;">                                     crop.getBottom() + 1, 0);</span>
<span style="color: #ff7f24; font-style: italic;">          */</span>
      }

      pdfStamper.close();

    } <span style="color: #00ffff;">catch</span> (<span style="color: #63b8ff;">IOException</span> <span style="color: #7fffd4;">e</span>) {
      e.printStackTrace();
    } <span style="color: #00ffff;">catch</span> (<span style="color: #63b8ff;">DocumentException</span> <span style="color: #7fffd4;">e</span>) {
      e.printStackTrace();
    }
  }
}
</pre>
</div>

<p>
Mohon dimaklumi jika kode terlihat janggal, bukan <code>java</code> <i>native
coder</i> soalnya :p
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2015-10-01</p>
<p class="author">Author: Kholid Fuadi</p>
<p class="date">Created: 2015-10-05 Mon 00:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
